[
	{
		"Name": "DevilDaggersSurvivalEditor",
		"DisplayName": "Devil Daggers Survival Editor",
		"VersionNumber": "2.34.0.0",
		"VersionNumberRequired": "2.34.0.0",
		"Changelog": [
			{
				"VersionNumber": "2.34.0.0",
				"Date": "2021-04-26T00:00:00",
				"Changes": [
					{
						"Description": "Added game version and game mode to the 'Download spawnset' window."
					},
					{
						"Description": "Fixed loading TimeAttack spawnsets from site when end loop preview was enabled."
					},
					{
						"Description": "Spawns are no longer bold (indicating end loop) for TimeAttack spawnsets."
					}
				]
			},
			{
				"VersionNumber": "2.33.0.0",
				"Date": "2021-04-25T00:00:00",
				"Changes": [
					{
						"Description": "Added support for 'TimeAttack' game mode."
					},
					{
						"Description": "Added new 'Diamond' arena preset."
					}
				]
			},
			{
				"VersionNumber": "2.31.9.0",
				"Date": "2021-04-20T00:00:00",
				"Changes": [
					{
						"Description": "Minor fixes for the 'Download spawnset' window."
					}
				]
			},
			{
				"VersionNumber": "2.31.6.0",
				"Date": "2021-04-14T00:00:00",
				"Changes": [
					{
						"Description": "Fixed UI lag for additional gems and timer start."
					},
					{
						"Description": "Fixed occasionally overwriting internal spawnset values caused by programmatic UI updates."
					},
					{
						"Description": "Added warning for disabling gem collection and setting hand to Level 2."
					}
				]
			},
			{
				"VersionNumber": "2.31.2.0",
				"Date": "2021-04-11T00:00:00",
				"Changes": [
					{
						"Description": "The application now allows you to disable gem collection which adds the possibility for more interesting spawnsets."
					},
					{
						"Description": "Fixed not always updating display spawn total gems correctly."
					}
				]
			},
			{
				"VersionNumber": "2.30.5.0",
				"Date": "2021-03-18T00:00:00",
				"Changes": [
					{
						"Description": "Fixed empty settings or cache files crashing the application."
					},
					{
						"Description": "Fixed About window crashing."
					},
					{
						"Description": "Removed Help window. The Help menu item now navigates to the Survival Editor Guide on the website."
					}
				]
			},
			{
				"VersionNumber": "2.30.2.0",
				"Date": "2021-03-15T00:00:00",
				"Changes": [
					{
						"Description": "Fixed potential uncaught exception caused by empty cached sorting directions."
					}
				]
			},
			{
				"VersionNumber": "2.30.1.0",
				"Date": "2021-03-13T00:00:00",
				"Changes": [
					{
						"Description": "Implemented caching for the 'Download spawnset' window. The application now remembers which sortings and filters were applied after closing the window, and also after closing the application."
					},
					{
						"Description": "Added shortcuts for switching between spawnset pages in the 'Download spawnset' window. (Arrow keys cannot be used for technical reasons.)",
						"SubChanges": [
							{
								"Description": "Use CTRL , to go to first page"
							},
							{
								"Description": "Use , to go to previous page"
							},
							{
								"Description": "Use . to go to next page"
							},
							{
								"Description": "Use CTRL . to go to last page"
							}
						]
					}
				]
			},
			{
				"VersionNumber": "2.28.18.0",
				"Date": "2021-03-10T00:00:00",
				"Changes": [
					{
						"Description": "Added support for reading and writing older survival formats. You can open and save V1 spawnsets and select the format you want to use in the editor."
					},
					{
						"Description": "Added cancellation to confirmation windows. Clicking [X] on a confirmation window now cancels the operation properly."
					},
					{
						"Description": "Rewrote 'Download spawnset' window. Now includes 'Custom leaderboard' and 'Practice' filtering, paging, improved and extended sorting, and improved performance."
					},
					{
						"Description": "User settings are now saved as settings.json in the local application data Windows folder (access by pressing Windows R and typing %localappdata%)."
					},
					{
						"Description": "Added keyboard shortcuts for every menu item under 'File'."
					},
					{
						"Description": "Added menu item to open default V3 survival file."
					},
					{
						"Description": "New V3.1 spawnset settings now have their own section."
					},
					{
						"Description": "Added [X] button to Settings window."
					},
					{
						"Description": "Removed glitch tile (25,27) setting, workaround, and warning. This seems to be fixed in V3.1."
					},
					{
						"Description": "Improved performance for updating spawns list."
					},
					{
						"Description": "Improved performance for individual spawn controls."
					},
					{
						"Description": "Warnings are now more apparent."
					},
					{
						"Description": "Fixed keyboard shortcut bugs."
					},
					{
						"Description": "Removed max spawns limit. Crash at your own risk."
					},
					{
						"Description": "Fixed bug where end loop timings would sometimes not update properly when editing start timer."
					},
					{
						"Description": "Improved keyboard shortcut support."
					},
					{
						"Description": "Improved logo."
					}
				]
			},
			{
				"VersionNumber": "2.15.0.0",
				"Date": "2021-02-24T00:00:00",
				"Changes": [
					{
						"Description": "Implemented TimerStart value which can be helpful for practice. This timer is only used as the initial start value for the in-game timer."
					}
				]
			},
			{
				"VersionNumber": "2.14.7.0",
				"Date": "2021-02-22T00:00:00",
				"Changes": [
					{
						"Description": "Added support for new practice values. You can now change the initial hand upgrade, as well as the amount of additional gems, in the survival file itself. This makes spawnsets significantly more interesting."
					},
					{
						"Description": "Custom spawnsets are now saved to the \"mods\" directory to keep the original survival file intact. You do not need to modify the original survival file anymore. When you are done playing a custom spawnset, just delete the file to go back to the original game."
					},
					{
						"Description": "The application now runs on .NET 5.0."
					},
					{
						"Description": "Added more keyboard shortcuts for menu items."
					},
					{
						"Description": "Functionality to quickly restore the original V3 spawnset has been replaced by a new option that lets you delete the survival mod file."
					},
					{
						"Description": "Removed validation of the survival file on launch."
					},
					{
						"Description": "Replaced \"no survival file\" warning with \"invalid Devil Daggers root folder\" warning."
					},
					{
						"Description": "Added AskToReplaceSurvivalFile and AskToDeleteSurvivalFile user settings."
					}
				]
			},
			{
				"VersionNumber": "2.10.13.0",
				"Date": "2020-10-07T00:00:00",
				"Changes": [
					{
						"Description": "Fixed \"Download\" button in UpdateRecommended window navigating to an outdated URL."
					},
					{
						"Description": "Removed misleading information from the Help window."
					}
				]
			},
			{
				"VersionNumber": "2.10.11.0",
				"Date": "2020-09-24T00:00:00",
				"Changes": [
					{
						"Description": "The application now uses a custom dark theme. General layout for many components has been improved as well."
					},
					{
						"Description": "Added Donut arena preset."
					},
					{
						"Description": "Added new user settings.",
						"SubChanges": [
							{
								"Description": "Ask to confirm arena generation. When generating an arena with a preset the application prompts if you really want to replace the current arena. This can now be turned off with this new setting so you don't have to click \"Yes\" every time, which is convenient when playing with presets that involve randomness."
							},
							{
								"Description": "Replace survival file with downloaded spawnset. When downloading a spawnset from within the application, it will ask if you want to replace the current survival file with the downloaded spawnset. This can now be done automatically, or not at all, using this new setting. You can set it to \"Always\", \"Ask\", or \"Never\"."
							},
							{
								"Description": "Load current survival file on start up."
							}
						]
					},
					{
						"Description": "Removed functionality to open log file from the menu as this doesn't work well with the current logging mechanism."
					},
					{
						"Description": "Spawn seconds are now properly rounded to physics ticks in Devil Daggers (1/60 of a second)."
					},
					{
						"Description": "Selecting an enemy type is now done with radio buttons rather than a dropdown."
					},
					{
						"Description": "Selecting a delay modification function in the ModifySpawnDelay window is now done with radio buttons rather than a dropdown."
					},
					{
						"Description": "Fixed crash when selecting all tiles."
					},
					{
						"Description": "Fixed 'No survival file' warning not updating after writing a spawnset to the file."
					},
					{
						"Description": "Fixed CheckingForUpdates window not waiting for the API result properly."
					},
					{
						"Description": "Fixed being able to divide delay by zero in the ModifySpawnDelay window."
					}
				]
			},
			{
				"VersionNumber": "2.7.6.1",
				"Date": "2020-08-20T00:00:00",
				"Changes": [
					{
						"Description": "Rebuilt application for API updates."
					}
				]
			},
			{
				"VersionNumber": "2.7.6.0",
				"Date": "2020-08-20T00:00:00",
				"Changes": [
					{
						"Description": "Rewrote much of the application."
					},
					{
						"Description": "Removed dependencies."
					},
					{
						"Description": "Ported to .NET Core. Application is no longer dependent on .NET Framework and does not require .NET Framework 4.6.1."
					},
					{
						"Description": "Fixed 'No survival file' warning not updating after restoring V3."
					},
					{
						"Description": "Fixed clicking settings CheckBoxes text not affecting the CheckBox states."
					},
					{
						"Description": "Fixed end loop warning seconds not being formatted correctly."
					},
					{
						"Description": "Fixed not showing end loop warning for a single spawn."
					},
					{
						"Description": "Fixed crash when attempting to view log file while it was being used by another process."
					},
					{
						"Description": "Fixed search TextBoxes in DownloadSpawnset window being empty after reopening the window."
					},
					{
						"Description": "Improved startup performance by reducing the amount of API calls."
					}
				]
			},
			{
				"VersionNumber": "2.4.16.0",
				"Date": "2020-06-10T00:00:00",
				"Changes": [
					{
						"Description": "Added 'Set' function to Modify Spawn Delay window."
					},
					{
						"Description": "Fixed clicking 'Clear previous tiles' text not affecting the CheckBox state."
					},
					{
						"Description": "Maintenance and small performance improvements."
					}
				]
			},
			{
				"VersionNumber": "2.4.13.1",
				"Date": "2019-11-18T00:00:00",
				"Changes": [
					{
						"Description": "Updated source code URL."
					}
				]
			},
			{
				"VersionNumber": "2.4.13.0",
				"Date": "2019-11-03T00:00:00",
				"Changes": [
					{
						"Description": "Changelog now indicates the currently running version."
					},
					{
						"Description": "Small changes related to maintenance of the website, as well as code refactoring and improvements."
					},
					{
						"Description": "Improved layout for Error window."
					}
				]
			},
			{
				"VersionNumber": "2.4.10.0",
				"Date": "2019-10-22T00:00:00",
				"Changes": [
					{
						"Description": "Added Changelog window."
					},
					{
						"Description": "Fixed the Update Recommended window not closing after clicking the download button."
					},
					{
						"Description": "Small changes related to maintenance of the website, as well as code refactoring and improvements."
					},
					{
						"Description": "Memory scanning code has been moved to Devil Daggers Core because the idea of merging Devil Daggers Survival Editor and Devil Daggers Custom Leaderboards was cancelled."
					}
				]
			},
			{
				"VersionNumber": "2.4.4.0",
				"Date": "2019-09-01T00:00:00",
				"Changes": [
					{
						"Description": "Removed \"Loop start\" column from the online spawnset list."
					},
					{
						"Description": "The Switch Enemy Type window now only displays enemy types that exist in the current spawn selection."
					},
					{
						"Description": "Removed minimum window size and added scrollbars that become active when the window size becomes smaller than 1366x768. This applies to the Main window and the Download Spawnset window."
					},
					{
						"Description": "Fixed spawn enemy text color not always updating correctly."
					},
					{
						"Description": "Small layout improvements."
					},
					{
						"Description": "Improved logging."
					},
					{
						"Description": "Internal changes such as importing Devil Daggers Custom Leaderboards specific code for memory scanning base functionality as preparation for possible custom leaderboard integration, as well as general code refactoring and improvements."
					}
				]
			},
			{
				"VersionNumber": "2.4.0.0",
				"Date": "2019-08-05T00:00:00",
				"Changes": [
					{
						"Description": "Added end loop preview which allows you to view spawn information for any wave. This includes Gigapedes changing into Ghostpedes every third wave. The end loop preview can also be turned off in the Settings window."
					},
					{
						"Description": "Added ability to increment/decrement tile heights by 0.1 while holding CTRL and using the mouse wheel."
					},
					{
						"Description": "Added functionality to auto-detect the location of the survival file within the Settings window."
					},
					{
						"Description": "Recreated layout for Settings window."
					},
					{
						"Description": "Optimized performance when deleting spawns."
					},
					{
						"Description": "Added \"clear search\" buttons to Download Spawnset window."
					},
					{
						"Description": "Added \"leaderboard\" column to the spawnset list in the Download Spawnset window."
					},
					{
						"Description": "Improved Download Spawnset window layout."
					},
					{
						"Description": "Added tooltips that display a spawnset's description if it has one."
					},
					{
						"Description": "Fixed log file not being written to."
					},
					{
						"Description": "Other small layout changes, bug fixes, and improvements."
					}
				]
			},
			{
				"VersionNumber": "2.3.1.0",
				"Date": "2019-07-30T00:00:00",
				"Changes": [
					{
						"Description": "Fixed crash that occurred when deleting multiple spawns."
					}
				]
			},
			{
				"VersionNumber": "2.3.0.0",
				"Date": "2019-07-30T00:00:00",
				"Changes": [
					{
						"Description": "Heavily optimized performance for the spawns section."
					},
					{
						"Description": "Added author sorting to the Download Spawnset window."
					},
					{
						"Description": "Fixed the application not asking whether you want to save the current spawnset when closing the application."
					},
					{
						"Description": "Fixed Modify Spawn Delay window being able to change spawn delay values into negative values."
					},
					{
						"Description": "The application now displays the Update Recommended window on start up when an update is available."
					},
					{
						"Description": "Layout improvements for the Download Spawnset window."
					}
				]
			},
			{
				"VersionNumber": "2.2.0.0",
				"Date": "2019-07-07T00:00:00",
				"Changes": [
					{
						"Description": "The application now keeps track of whether or not you have any unsaved changes and will ask you if you want to save the spawnset before proceeding to overwrite it by opening an existing spawnset, creating a new one, or closing the application."
					},
					{
						"Description": "The application window title now displays the current spawnset's name if it has one."
					},
					{
						"Description": "Added 'File > Save as' menu item."
					},
					{
						"Description": "Added shortcut keys:",
						"SubChanges": [
							{
								"Description": "CTRL+S - Save"
							},
							{
								"Description": "CTRL+C - Copy currently selected spawn(s)"
							},
							{
								"Description": "CTRL+V - Paste spawn(s) currently on the clipboard"
							},
							{
								"Description": "Delete - Delete currently selected spawn(s)"
							}
						]
					},
					{
						"Description": "The Download Spawnset window now remembers the spawnset sorting after it is closed."
					},
					{
						"Description": "The application now asks you to confirm to overwrite the existing arena with a preset, as this cannot be undone easily."
					},
					{
						"Description": "The maximum amount of spawns you can have per spawnset is now set to 10,000."
					},
					{
						"Description": "Improved messages when saving or replacing spawnsets."
					},
					{
						"Description": "Fixed the survival file restore writing the original file bytes on top of the file instead of overwriting it entirely."
					},
					{
						"Description": "Fixed the application not displaying an \"unsaved changes\" warning message when opening the currently active survival file."
					},
					{
						"Description": "Fixed the end loop not being displayed correctly when there are no EMPTY spawns in the spawnset."
					},
					{
						"Description": "Performance optimizations, layout improvements, and other bug fixes."
					}
				]
			},
			{
				"VersionNumber": "2.1.1.0",
				"Date": "2019-07-05T00:00:00",
				"Changes": [
					{
						"Description": "Hotfix for restoring the default survival file."
					}
				]
			},
			{
				"VersionNumber": "2.1.0.0",
				"Date": "2019-07-05T00:00:00",
				"Changes": [
					{
						"Description": "Added spawnset sorting to the Download Spawnset window."
					},
					{
						"Description": "Added Select All and Deselect All buttons to the arena editor."
					},
					{
						"Description": "Added copy/paste functionality to the spawns editor."
					},
					{
						"Description": "Added timeout for web requests so the application doesn't keep waiting when the website is offline."
					},
					{
						"Description": "Fixed tile elements not updating colors after rounding or randomising."
					},
					{
						"Description": "The spawns editor scrollbar now scrolls to the end when adding new spawns."
					},
					{
						"Description": "The Download Spawnset window now remembers the author and spawnset search values after it is closed."
					},
					{
						"Description": "The default survival file is now embedded into the executable so the actual file is not needed anymore. This removes the issue where the application crashes whenever the file would not be present."
					},
					{
						"Description": "Optimizations and layout improvements."
					}
				]
			},
			{
				"VersionNumber": "2.0.0.0",
				"Date": "2019-06-29T00:00:00",
				"Changes": [
					{
						"Description": "General",
						"SubChanges": [
							{
								"Description": "Made the main application window resizable (includes fullscreen)."
							},
							{
								"Description": "Added loading screen."
							},
							{
								"Description": "Made user input more lenient, less errors will be thrown and the application will just deal with input values even if they don't make much sense."
							}
						]
					},
					{
						"Description": "Fixes",
						"SubChanges": [
							{
								"Description": "Fixed issue where the arena was always incorrectly rotated and mirrored."
							},
							{
								"Description": "Fixed issue where restoring the original V3 spawnset would remove the survival file from the application's 'Content' folder and as a result the option no longer works until the file is put back (either by re-downloading the application or by doing it manually)."
							},
							{
								"Description": "Fixed issue where the application would not start up again after using it (due to the issue above)."
							},
							{
								"Description": "Fixed issue where you could create spawns with a negative delay value."
							}
						]
					},
					{
						"Description": "Spawns",
						"SubChanges": [
							{
								"Description": "Added ability to modify (add, subtract, multiply, divide) delays for selected spawns. This can be used to easily speed up or slow down parts of a spawnset, or a spawnset in its entirety."
							},
							{
								"Description": "Added ability to switch enemy types for selected spawns."
							},
							{
								"Description": "Added ability to add or insert the same spawn multiple times at once using the Amount value."
							}
						]
					},
					{
						"Description": "Arena",
						"SubChanges": [
							{
								"Description": "Set the max tile height to 54 rather than 63, since any tiles with a height value greater than 54 will be in complete darkness and won't be visible (regardless of the spawnset brightness setting, or the in-game gamma setting)."
							},
							{
								"Description": "The arena editor now shows void tile heights as \"Void\" rather than their actual (meaningless) value."
							},
							{
								"Description": "Added height selector which lets you pick a height and use it in the arena editor."
							},
							{
								"Description": "Removed the old height map as this is now redundant."
							},
							{
								"Description": "Added multiple tile selection to the arena editor."
							},
							{
								"Description": "Added continuous tile modification and selection to the arena editor."
							},
							{
								"Description": "Added rectangular tile modification and selection to the arena editor."
							},
							{
								"Description": "Added ability to round heights for selected tiles."
							},
							{
								"Description": "Added ability to randomize heights for selected tiles."
							},
							{
								"Description": "Added ability to rotate and flip the arena."
							},
							{
								"Description": "Made the tiles brighter for better visibility."
							},
							{
								"Description": "Optimized the shrink preview slider for better performance."
							},
							{
								"Description": "Implemented custom pixel shading for the arena editor to take advantage of high-performant GPU rendering to render lighting, selection borders and selection highlighting."
							}
						]
					},
					{
						"Description": "Arena presets",
						"SubChanges": [
							{
								"Description": "Renamed Pyramid preset to Qbert."
							},
							{
								"Description": "Renamed Cage preset to Cage Rectangular."
							},
							{
								"Description": "Renamed Random preset to Random Noise."
							},
							{
								"Description": "Added new arena presets:",
								"SubChanges": [
									{
										"Description": "Cage Ellipse"
									},
									{
										"Description": "Ellipse"
									},
									{
										"Description": "Hill"
									},
									{
										"Description": "Pyramid"
									},
									{
										"Description": "Random Gaps"
									},
									{
										"Description": "Random Islands"
									},
									{
										"Description": "Random Pillars"
									}
								]
							},
							{
								"Description": "Removed Default Flat preset, as it can now be created using the new Ellipse preset, or using the Round Heights button on the Default arena."
							},
							{
								"Description": "Added wall thickness parameter to Cage Rectangular preset."
							},
							{
								"Description": "Added offset parameters to Qbert preset."
							},
							{
								"Description": "Added option for arena presets whether to overwrite the previous arena entirely or to generate new tiles on top of it."
							}
						]
					},
					{
						"Description": "Menu",
						"SubChanges": [
							{
								"Description": "Replaced the Open From DevilDaggers.info menu item with a new Download Spawnset window which contains the spawnsets list."
							},
							{
								"Description": "Added menu item to open the current survival file."
							}
						]
					},
					{
						"Description": "Spawnsets from DevilDaggers.info",
						"SubChanges": [
							{
								"Description": "Added search and filter options to the spawnsets list."
							},
							{
								"Description": "The spawnsets list now shows more information (such as when the loop starts) about the spawnsets."
							}
						]
					},
					{
						"Description": "Miscellaneous",
						"SubChanges": [
							{
								"Description": "Added various warnings:",
								"SubChanges": [
									{
										"Description": "The application warns you when the spawnset you're creating might cause Devil Daggers to become unstable, for instance when the end loop is very short, or when you're spawning the player in the void. This also includes the new discovery of the {25, 27} tile, which causes Devil Daggers to glitch whenever its height is put to a value greater than 0.4973333."
									},
									{
										"Description": "The application warns you when the path to the survival file in the user settings is incorrect, or when the file could not be parsed."
									}
								]
							},
							{
								"Description": "Added more settings:",
								"SubChanges": [
									{
										"Description": "Prevent the player from spawning in the void by making sure the spawn tile always has a height."
									},
									{
										"Description": "Prevent tile {25, 27} from going outside of its safe range."
									}
								]
							},
							{
								"Description": "The application now uses logging, so whenever it crashes you can open the log to see what went wrong."
							},
							{
								"Description": "The application is now dependent on DevilDaggersCore, which is a .NET Standard class library used to share code between various Devil Daggers related applications."
							}
						]
					}
				]
			},
			{
				"VersionNumber": "1.1.5.0",
				"Date": "2018-11-04T00:00:00",
				"Changes": [
					{
						"Description": "Added functionality to automatically check for new versions of the program."
					}
				]
			},
			{
				"VersionNumber": "1.1.4.0",
				"Date": "2018-08-05T00:00:00",
				"Changes": [
					{
						"Description": "Downloading spawnsets and retrieving the spawnset list is now done asynchronously so it doesn't block the application."
					},
					{
						"Description": "Added functionality to reload the spawnset list if there was no internet connection or if the site was unresponsive."
					},
					{
						"Description": "Various fixes and small improvements."
					}
				]
			},
			{
				"VersionNumber": "1.1.2.0",
				"Date": "2018-07-27T00:00:00",
				"Changes": [
					{
						"Description": "Added functionality to download spawnsets directly from DevilDaggers.info within the menu."
					}
				]
			},
			{
				"VersionNumber": "1.0.2.0",
				"Date": "2018-07-26T00:00:00",
				"Changes": [
					{
						"Description": "Enforced en-US globalization."
					}
				]
			},
			{
				"VersionNumber": "1.0.1.0",
				"Date": "2018-06-25T00:00:00",
				"Changes": [
					{
						"Description": "Fixed not being able to read some spawnsets made using a hex editor when reading an undefined enemy type."
					}
				]
			},
			{
				"VersionNumber": "1.0.0.0",
				"Date": "2018-06-16T00:00:00",
				"Changes": [
					{
						"Description": "Initial release."
					}
				]
			},
			{
				"VersionNumber": "0.9.0.0",
				"Date": "2018-05-14T00:00:00",
				"Changes": [
					{
						"Description": "Beta release."
					}
				]
			}
		]
	},
	{
		"Name": "DevilDaggersCustomLeaderboards",
		"DisplayName": "Devil Daggers Custom Leaderboards",
		"VersionNumber": "1.0.0.0",
		"VersionNumberRequired": "1.0.0.0",
		"Changelog": [
			{
				"VersionNumber": "1.0.0.0",
				"Date": "2021-03-16T00:00:00",
				"Changes": [
					{
						"Description": "The application now retrieves the memory offset from the DevilDaggers.info API, so no updates for the program are required each time Devil Daggers itself gets updated."
					}
				]
			},
			{
				"VersionNumber": "0.14.7.0",
				"Date": "2021-03-12T00:00:00",
				"Changes": [
					{
						"Description": "Fixed not detecting Devil Daggers process after restart."
					}
				]
			},
			{
				"VersionNumber": "0.14.6.0",
				"Date": "2021-03-11T00:00:00",
				"Changes": [
					{
						"Description": "Applied new API updates to fix replays overwriting real scores by 1/60 second due to bug in game."
					}
				]
			},
			{
				"VersionNumber": "0.14.5.0",
				"Date": "2021-03-10T00:00:00",
				"Changes": [
					{
						"Description": "You can now submit replays."
					},
					{
						"Description": "New stat 'Homing daggers eaten' is now sent to the server."
					},
					{
						"Description": "Improved logo."
					}
				]
			},
			{
				"VersionNumber": "0.14.2.0",
				"Date": "2021-02-25T00:00:00",
				"Changes": [
					{
						"Description": "Works with the latest Devil Daggers build."
					}
				]
			},
			{
				"VersionNumber": "0.14.1.0",
				"Date": "2021-02-21T00:00:00",
				"Changes": [
					{
						"Description": "The application now works with Devil Daggers V3.1 and has the new features built-in, such as the Leviathan dagger and the new death types."
					},
					{
						"Description": "Added new stats: Gems despawned, Gems eaten, Gems total, Enemies alive per enemy type, Enemies killed per enemy type"
					},
					{
						"Description": "The Homing dagger has been replaced by the new Leviathan dagger."
					},
					{
						"Description": "The application now runs on .NET 5.0."
					},
					{
						"Description": "Graphical improvements (for as far as console graphics go) and other small improvements."
					},
					{
						"Description": "Fixed detection for usernames longer than 16 characters."
					}
				]
			},
			{
				"VersionNumber": "0.10.4.0",
				"Date": "2020-10-01T00:00:00",
				"Changes": [
					{
						"Description": "The application does not display misleading stats in the menu or lobby anymore."
					},
					{
						"Description": "Improved update messages."
					},
					{
						"Description": "Fixed tiny bug where getting the very same score as a dagger time would display the score in the wrong color."
					},
					{
						"Description": "Implemented API updates as preparation for a new leaderboard category."
					}
				]
			},
			{
				"VersionNumber": "0.10.0.0",
				"Date": "2020-08-24T00:00:00",
				"Changes": [
					{
						"Description": "Implemented custom improved colors."
					},
					{
						"Description": "Fixed not resetting homing after death."
					},
					{
						"Description": "Fixed user highlight being unreadable for 'Default' dagger scores."
					},
					{
						"Description": "Improved anti-cheat."
					},
					{
						"Description": "Implemented collecting graph data for custom leaderboards. This is only stored in the database for now and not yet displayed on the website."
					}
				]
			},
			{
				"VersionNumber": "0.9.6.1",
				"Date": "2020-08-21T00:00:00",
				"Changes": [
					{
						"Description": "Rebuilt application for API updates."
					}
				]
			},
			{
				"VersionNumber": "0.9.6.0",
				"Date": "2020-08-20T00:00:00",
				"Changes": [
					{
						"Description": "Rewrote much of the application."
					},
					{
						"Description": "Removed dependencies."
					},
					{
						"Description": "Ported to .NET Core. Application is no longer dependent on .NET Framework and does not require .NET Framework 4.6.1."
					},
					{
						"Description": "Fixed crash that occurred when setting a very large custom font size."
					},
					{
						"Description": "Added icon."
					},
					{
						"Description": "Renamed 'Shots' to 'Daggers'."
					},
					{
						"Description": "Fixed resetting homing to 0 just before detecting player death."
					},
					{
						"Description": "Fixed writing level up difference when previous highscore did not achieve that level."
					},
					{
						"Description": "Fixed not being able to read current upgrade and homing count in some Devil Daggers instances due to malformed pointer chains."
					}
				]
			},
			{
				"VersionNumber": "0.6.1.0",
				"Date": "2020-05-08T00:00:00",
				"Changes": [
					{
						"Description": "Fixed ascending leaderboards displaying incorrect dagger colors and statistic differences."
					}
				]
			},
			{
				"VersionNumber": "0.6.0.0",
				"Date": "2020-05-07T00:00:00",
				"Changes": [
					{
						"Description": "Leaderboards and run info are now displayed in the console when the player died."
					},
					{
						"Description": "Added colors for daggers, deaths, and statistic differences."
					},
					{
						"Description": "Fixed floating point imprecision issues with the leaderboard database."
					},
					{
						"Description": "The program now shows a warning when homing and level up times are not being detected. This warning will be triggered after collecting the first gem. The problem can be resolved by restarting Devil Daggers. It happens about 1 out of 10 times for me and seems to appear randomly. I'm still investigating what causes it."
					}
				]
			},
			{
				"VersionNumber": "0.4.4.0",
				"Date": "2019-11-03T00:00:00",
				"Changes": [
					{
						"Description": "Compatibility and maintenance updates related to the website."
					},
					{
						"Description": "The application is renamed to Devil Daggers Custom Leaderboards again for consistency with the other tool names."
					}
				]
			},
			{
				"VersionNumber": "0.4.3.0",
				"Date": "2019-08-08T00:00:00",
				"Changes": [
					{
						"Description": "Improved way of detecting survival file cheats; there is no need to record the entire run anymore."
					},
					{
						"Description": "Fixed log file not being written to."
					},
					{
						"Description": "Implemented \"Speedrun\" category leaderboards."
					}
				]
			},
			{
				"VersionNumber": "0.4.0.1",
				"Date": "2019-06-05T00:00:00",
				"Changes": [
					{
						"Description": "Compatibility update due to some internal bug fixes which aren't related to the application directly."
					}
				]
			},
			{
				"VersionNumber": "0.4.0.0",
				"Date": "2019-05-27T00:00:00",
				"Changes": [
					{
						"Description": "Leaderboards are now secured with the Advanced Encryption Standard (AES)."
					}
				]
			},
			{
				"VersionNumber": "0.3.3.0",
				"Date": "2019-05-24T00:00:00",
				"Changes": [
					{
						"Description": "Fixed inconsistent spawnset hashing. The hashing system is no longer dependent on files. This fixes the problem where some spawnsets wouldn't work if they were downloaded directly from the website rather than imported via Devil Daggers Survival Editor."
					}
				]
			},
			{
				"VersionNumber": "0.3.0.0",
				"Date": "2019-05-20T00:00:00",
				"Changes": [
					{
						"Description": "The program now tells you when there is an update available and warns you when the current version is no longer accepted by the server."
					}
				]
			},
			{
				"VersionNumber": "0.2.5.0",
				"Date": "2019-05-19T00:00:00",
				"Changes": [
					{
						"Description": "Added logging."
					},
					{
						"Description": "Some improvements in the layout and better feedback for when runs don't upload."
					},
					{
						"Description": "Crash fixes and internal clean up. The \"out of bounds\" error shouldn't occur anymore when starting the application before starting Devil Daggers."
					},
					{
						"Description": "Console is no longer resizable so it doesn't mess with the layout."
					},
					{
						"Description": "Added a retry count for when the upload fails. Usually it retries 3 times and stops after that, waiting for you to restart a run."
					}
				]
			},
			{
				"VersionNumber": "0.2.1.0",
				"Date": "2019-05-18T00:00:00",
				"Changes": [
					{
						"Description": "Lots of internal clean up, improvements, and fixes."
					},
					{
						"Description": "Program now outputs what values it submits to the server."
					},
					{
						"Description": "Program only retrieves the spawnset hash during the first second of the run so people cannot cheat by changing the survival file during the run. If you start the program later than 1 second after the run starts, the hash will not be calculated and your submission will be marked as invalid and not upload."
					},
					{
						"Description": "The server now has a minimal version it will accept submissions from."
					}
				]
			},
			{
				"VersionNumber": "0.1.10.0",
				"Date": "2019-05-18T00:00:00",
				"Changes": [
					{
						"Description": "Small fixes."
					}
				]
			},
			{
				"VersionNumber": "0.1.9.0",
				"Date": "2019-05-18T00:00:00",
				"Changes": [
					{
						"Description": "Application now uses .NET Framework 4.6.1 rather than 4.7.2."
					},
					{
						"Description": "Fixed bug where level up values don't reset when you restart a run."
					},
					{
						"Description": "Prevented replays from uploading so people won't submit runs to the wrong leaderboard by intentionally replacing the survival file during the replay."
					}
				]
			},
			{
				"VersionNumber": "0.1.5.0",
				"Date": "2019-05-17T00:00:00",
				"Changes": [
					{
						"Description": "Made application Windows-only because scanning memory for other operating systems will work differently anyway."
					},
					{
						"Description": "Enforced en-US culture to fix broken submissions on PCs that use commas as decimal separators."
					},
					{
						"Description": "Fixed usernames being limited to 4 characters."
					},
					{
						"Description": "Prevented submissions with 0.0000 time from uploading by setting a time constraint of a minimum of 2.5 seconds."
					}
				]
			},
			{
				"VersionNumber": "0.1.0.0",
				"Date": "2019-05-15T00:00:00",
				"Changes": [
					{
						"Description": "Initial release."
					}
				]
			}
		]
	},
	{
		"Name": "DevilDaggersAssetEditor",
		"DisplayName": "Devil Daggers Asset Editor",
		"VersionNumber": "0.60.2.1",
		"VersionNumberRequired": "0.46.0.0",
		"Changelog": [
			/*
			You can now search/preview/download&install mods hosted on the website from within the app.
			Descriptions and tags for assets are now retrieved from the DevilDaggers.info API, so changes to descriptions or tags do not require an update for DDAE anymore. The asset list itself is still stored in the application so everything still works when you are not connected to the internet.
			*/
			{
				"VersionNumber": "0.60.2.1",
				"Date": "2021-04-22T00:00:00",
				"Changes": [
					{
						"Description": "Rebuilt application to fix missing dependency."
					}
				]
			},
			{
				"VersionNumber": "0.60.2.0",
				"Date": "2021-04-20T00:00:00",
				"Changes": [
					{
						"Description": "Added missing 'core' shader asset, which fixes creating 'core' mods."
					},
					{
						"Description": "When making a binary, the 'core' path is set to the original file, since it does not support partial mods."
					},
					{
						"Description": "Added 'Loading UI...' to initial MainWindow start up instead of blocking GUI thread which results in the entire window being white."
					},
					{
						"Description": "Added descriptions and tags to most model bindings."
					},
					{
						"Description": "Fixed feather assets not being listed as blocked."
					},
					{
						"Description": "Minor UI improvements."
					}
				]
			},
			{
				"VersionNumber": "0.56.5.0",
				"Date": "2021-04-12T00:00:00",
				"Changes": [
					{
						"Description": "The application now keeps track of whether or not you have any unsaved changes and will ask you if you want to save the mod before proceeding to overwrite it by opening an existing mod, creating a new one, or closing the application."
					},
					{
						"Description": "The application window title now displays the name of the currently opened mod."
					},
					{
						"Description": "Added 'File > Save as' menu item."
					},
					{
						"Description": "Added cancellation to confirmation windows. Clicking [X] on a confirmation window now cancels the operation properly."
					},
					{
						"Description": "Implemented functionality to trim binaries. This is particularly useful for binaries that were compiled before Devil Daggers V3.1 came out. Back then, partial mods were not supported. With this tool you can make your old binary file a lot smaller by leaving out all the unchanged assets, which can be done by comparing it against the original binary. The tool can be found under Tools > Trim binary file."
					},
					{
						"Description": "User settings are now saved as settings.json in the local application data Windows folder (access by pressing Windows R and typing %localappdata%)."
					},
					{
						"Description": "Added keyboard shortcuts for most menu items under 'File'."
					},
					{
						"Description": "Implemented caching for the 'Make binaries' window. The application will remember the input values after closing the window or the application entirely."
					},
					{
						"Description": "Added [X] button to Settings window."
					},
					{
						"Description": "Fixed empty settings or cache files crashing the application."
					},
					{
						"Description": "Removed functionality to mod the particle file."
					},
					{
						"Description": "Removed Help window. The Help menu item now navigates to the Asset Editor Guide on the website."
					},
					{
						"Description": "Improved logo."
					}
				]
			},
			{
				"VersionNumber": "0.46.0.0",
				"Date": "2021-02-26T00:00:00",
				"Changes": [
					{
						"Description": "Application is now compatible with the latest version of Devil Daggers. The new shader assets have been added, and the program will display which assets are prohibited (meaning you cannot submit 1000+ scores if these assets are modified)."
					},
					{
						"Description": "Application now runs on .NET 5.0. You will need to install .NET Desktop Runtime 5.0.x to run this version."
					},
					{
						"Description": "Application now allows creation of partial mods. These are mods that only specify assets that have been modified. It is no longer required to create a binary file containing all assets. It also allows you to load multiple partial mods simultaneously. You can, for instance, load a partial mod that only changes the texture for Skull I, and then load another mod that changes the texture for the arena tiles."
					},
					{
						"Description": "Added CheckBox to include sub-directories when importing assets."
					},
					{
						"Description": "Added 'File > New' menu item to easily clear the list of specified paths and start a new mod."
					},
					{
						"Description": "Made the previewer and asset lists adjust better to the window size so the application works much better on smaller screen resolutions."
					},
					{
						"Description": "Fixed incorrect description for the post_lut_leveldown texture."
					},
					{
						"Description": "Fixed underscores not being displayed correctly in previewer labels."
					},
					{
						"Description": "Fixed hardcoded \"Model Binding name\" header row that should just say \"Asset name\" instead."
					}
				]
			},
			{
				"VersionNumber": "0.39.11.0",
				"Date": "2020-11-17T00:00:00",
				"Changes": [
					{
						"Description": "Rewrote the application and GUI entirely."
					},
					{
						"Description": "Made the menu more intuitive by adding 'Extract binaries', 'Make binaries', and 'Import folders' windows."
					},
					{
						"Description": "The mod format has changed. DDAE will no longer accept mod files with the extension .audio, .core, .dd, and .particle. Mod files are now saved under a unified extension named .ddae, which holds all asset data even if your mod does not specify, for example, particle assets. The easiest way to migrate is just to re-import your assets and save it as a .ddae file."
					},
					{
						"Description": "Added more missing asset descriptions and tags."
					},
					{
						"Description": "Fixed 'chatterminisquid' audio asset being listed as unused while 'chattersquidsmall' is the one that's unused."
					},
					{
						"Description": "Improved error messages when parsing .obj files."
					},
					{
						"Description": "Fixed audio previewer not reloading selected asset when setting new path."
					},
					{
						"Description": "Many other bug fixes, performance improvements, and styling improvements."
					}
				]
			},
			{
				"VersionNumber": "0.18.4.0",
				"Date": "2020-10-21T00:00:00",
				"Changes": [
					{
						"Description": "The application now uses a custom dark theme. General layout for many components has been improved as well."
					},
					{
						"Description": "Added GLSL syntax highlighting."
					},
					{
						"Description": "Fixed shader assets not being saved to mod file on extraction."
					},
					{
						"Description": "Fixed Windows Explorer folder dialogs opening the directory above the specified folder."
					},
					{
						"Description": "Fixed audio previewer crashing when attempting to play an empty audio file."
					}
				]
			},
			{
				"VersionNumber": "0.16.16.0",
				"Date": "2020-10-07T00:00:00",
				"Changes": [
					{
						"Description": "Fixed loudness values not being set when creating a mod file after extracting an audio binary."
					},
					{
						"Description": "Fixed \"Access is denied\" error when attempting to open mod folder in Windows Explorer."
					},
					{
						"Description": "Fixed \"Download\" button in UpdateRecommended window navigating to an outdated URL."
					},
					{
						"Description": "Fixed CheckingForUpdates window not waiting for the API result properly."
					},
					{
						"Description": "Improved confirmation windows."
					},
					{
						"Description": "Improved progress logging."
					},
					{
						"Description": "Improved error messages regarding extracting and making binaries."
					},
					{
						"Description": "Added more model descriptions and tags."
					},
					{
						"Description": "Added missing audio tags."
					},
					{
						"Description": "Removed functionality to open log file from the menu as this doesn't work well with the current logging mechanism."
					},
					{
						"Description": "Parsing model vertices now supports scientific notation."
					},
					{
						"Description": "Better error messages are shown when model face data could not be parsed."
					},
					{
						"Description": "Note: Dark theme is used for windows that are shared between DevilDaggersSurvivalEditor and DevilDaggersAssetEditor. I plan to fully integrate dark theme into DDAE in a future update."
					}
				]
			},
			{
				"VersionNumber": "0.16.3.0",
				"Date": "2020-08-23T00:00:00",
				"Changes": [
					{
						"Description": "Fixed importing folders not working."
					}
				]
			},
			{
				"VersionNumber": "0.16.2.0",
				"Date": "2020-08-20T00:00:00",
				"Changes": [
					{
						"Description": "Rewrote much of the application."
					},
					{
						"Description": "Removed dependencies."
					},
					{
						"Description": "Ported to .NET Core. Application is no longer dependent on .NET Framework and does not require .NET Framework 4.6.1."
					},
					{
						"Description": "Added loading screen."
					},
					{
						"Description": "Fixed crash when attempting to view log file while it was being used by another process."
					},
					{
						"Description": "Improved performance."
					}
				]
			},
			{
				"VersionNumber": "0.13.22.0",
				"Date": "2020-06-10T00:00:00",
				"Changes": [
					{
						"Description": "Fixed bug when extracting particles."
					},
					{
						"Description": "Added Help window."
					},
					{
						"Description": "Improved particle previewer."
					}
				]
			},
			{
				"VersionNumber": "0.13.19.0",
				"Date": "2020-06-05T00:00:00",
				"Changes": [
					{
						"Description": "Fixed bug when saving a .dd mod file after extracting."
					}
				]
			},
			{
				"VersionNumber": "0.13.18.0",
				"Date": "2020-06-03T00:00:00",
				"Changes": [
					{
						"Description": "Fixed crash that occurred when attempting to open a non-existing initial directory in an explorer dialog."
					},
					{
						"Description": "Fixed auto-detect button in settings windows setting the path to an incorrect value."
					},
					{
						"Description": "Fixed opening mods root folder instead of assets root folder when importing or exporting loudness files."
					},
					{
						"Description": "Fixed texture dimension limit setting affecting non-model textures. Post lut filters, icons, fonts, and title screens will no longer be downscaled."
					}
				]
			},
			{
				"VersionNumber": "0.13.14.0",
				"Date": "2020-06-01T00:00:00",
				"Changes": [
					{
						"Description": "Removed the term 'compression' from the UI since it is misleading. What used to be called compressing is now called making a binary."
					},
					{
						"Description": "Added missing audio assets to the editor."
					},
					{
						"Description": "Fixed bugs related to the audio loudness file."
					}
				]
			},
			{
				"VersionNumber": "0.13.11.0",
				"Date": "2020-05-29T00:00:00",
				"Changes": [
					{
						"Description": "The application is now fully compatible with 3D modeling software (e.g. Blender) -- the implementation of turning models into binary data is hereby complete.",
						"SubChanges": [
							{
								"Description": "Making a 'dd' binary now supports UV mapping which means textures are properly rendered onto models."
							},
							{
								"Description": "Making a 'dd' binary now supports models consisting of quads."
							}
						]
					},
					{
						"Description": "You can now sort assets."
					},
					{
						"Description": "Implemented tags for assets."
					},
					{
						"Description": "You can now filter assets by tags using the new buttons in the column headers."
					},
					{
						"Description": "Added more settings.",
						"SubChanges": [
							{
								"Description": "You can now choose whether or not to make use of the 3 standard folders."
							},
							{
								"Description": "You can now choose to automatically create a mod file when extracting assets from a binary file."
							},
							{
								"Description": "You can now choose to automatically open the folder after extracting assets."
							},
							{
								"Description": "There is a new setting that enables automatic downscaling for large textures. This setting is set to 512 by default, since the largest original textures in Devil Daggers are 512x512 pixels. This currently applies to all textures, including post lut filters, icons, fonts, and title screens. This means the entire game will look different when you set this setting to 64 for example. All textures will shrink until they fit in a 64x64 pixel space (so a 256x16 texture will be downscaled to 64x4)."
							}
						]
					},
					{
						"Description": "Added binary file analyzer tool that can be used to visualize the contents of a Devil Daggers binary file. This can be helpful in case your file happens to be unnecessarily large and you want to know what causes it."
					},
					{
						"Description": "Implemented user caching. This means the application will remember certain values when it shuts down.",
						"SubChanges": [
							{
								"Description": "It will remember which mod files were last opened in the previous session."
							},
							{
								"Description": "It will remember which tab was active in the previous session."
							},
							{
								"Description": "It will remember the window size from the previous session including whether the application was run in full screen or not."
							},
							{
								"Description": "It will remember whether or not 'Auto-play' was enabled in the audio previewer."
							}
						]
					},
					{
						"Description": "Added vertex and index counts to model previewer."
					},
					{
						"Description": "Added more descriptions and asset information."
					},
					{
						"Description": "Fixes",
						"SubChanges": [
							{
								"Description": "Fixed inner window not sizing correctly in full screen."
							},
							{
								"Description": "Fixed text overflowing (still WIP, hoping to improve this in a future update)."
							},
							{
								"Description": "Fixed misleading editor paths for shaders by displaying editor paths for both files."
							},
							{
								"Description": "Fixed marking negative loudness values as valid."
							},
							{
								"Description": "Fixed showing paths for non-existing files."
							},
							{
								"Description": "Fixed texture previewer locking image files even when they're no longer being displayed."
							},
							{
								"Description": "Fixed texture previewer locking the currently displayed image file."
							},
							{
								"Description": "Fixed not clearing previewers when selecting an empty asset."
							},
							{
								"Description": "Fixed crash that occurred when attempting to preview a non-existing file."
							}
						]
					},
					{
						"Description": "Many layout improvements"
					}
				]
			},
			{
				"VersionNumber": "0.7.14.0",
				"Date": "2020-03-13T00:00:00",
				"Changes": [
					{
						"Description": "Fixed crash that occurred when turning textures into binary data."
					},
					{
						"Description": "Fixed textures not being correctly imported from mod files."
					}
				]
			},
			{
				"VersionNumber": "0.7.13.0",
				"Date": "2020-02-15T00:00:00",
				"Changes": [
					{
						"Description": "Added almost all texture descriptions."
					}
				]
			},
			{
				"VersionNumber": "0.7.12.0",
				"Date": "2019-11-30T00:00:00",
				"Changes": [
					{
						"Description": "Improved model extraction to be more compatible with 3D modeling software."
					},
					{
						"Description": "Fixed crash that occurred when attempting to turn a model with more texture coordinates or more vertex normals than geometric vertices into binary data."
					},
					{
						"Description": "Saving mod files now produces indented JSON."
					}
				]
			},
			{
				"VersionNumber": "0.7.8.0",
				"Date": "2019-11-26T00:00:00",
				"Changes": [
					{
						"Description": "Improved model parsing so turning .obj files exported from 3D modeling software into binary data is supported."
					},
					{
						"Description": "Fixed audio description for daggerseek."
					},
					{
						"Description": "Added tooltips for audio preview buttons."
					}
				]
			},
			{
				"VersionNumber": "0.7.5.1",
				"Date": "2019-11-18T00:00:00",
				"Changes": [
					{
						"Description": "Updated source code URL."
					}
				]
			},
			{
				"VersionNumber": "0.7.5.0",
				"Date": "2019-11-03T00:00:00",
				"Changes": [
					{
						"Description": "Implemented making shader, model (limited), and texture binaries. Features such as making binaries and using mod files for \"dd\" and \"core\" are now available and functional. Note that the editor path for shaders can be misleading. For instance when it says the path is \"..boid.glsl\", it actually points to the files \"..boid_fragment.glsl\" and \"..boid_vertex.glsl\". Also note that .obj parsing (model format) is still limited and might not work depending on what kind of .obj file you're trying to turn into binary data. It does work for the original models, or files in an identical .obj format, so you can successfully swap the original models."
					},
					{
						"Description": "Implemented audio player with the ability to pitch shift audio real-time."
					},
					{
						"Description": "Implemented texture, shader, model binding, and particle previewers. A model previewer has not yet been implemented."
					},
					{
						"Description": "Added Changelog window."
					},
					{
						"Description": "Fixed the Update Recommended window not closing after clicking the download button."
					},
					{
						"Description": "Small changes related to maintenance of the website, as well as code refactoring and improvements."
					},
					{
						"Description": "Removed functionality for compatibility with version 0.2.0.0."
					},
					{
						"Description": "Many bug fixes, layout improvements, and stability improvements."
					}
				]
			},
			{
				"VersionNumber": "0.3.3.0",
				"Date": "2019-09-23T00:00:00",
				"Changes": [
					{
						"Description": "Created progress bar for lengthy tasks such as making and extracting binaries."
					},
					{
						"Description": "Many bug fixes."
					},
					{
						"Description": "Improved audio descriptions."
					}
				]
			},
			{
				"VersionNumber": "0.3.0.0",
				"Date": "2019-09-21T00:00:00",
				"Changes": [
					{
						"Description": "Implemented extracting and making particle binaries, as well as mod files for particle mods. The extracted particle files are in binary (.bin), so there is not much to mod until I figure out what the bytes mean, but you can switch particles and replace them with others."
					},
					{
						"Description": "Implemented functionality to specify whether or not to use relative paths in mod files."
					},
					{
						"Description": "Added user settings to specify Devil Daggers root folder, mods root folder, and assets root folder."
					},
					{
						"Description": "Improve initial directories for file and folder dialogs."
					},
					{
						"Description": "Small bug and crash fixes."
					},
					{
						"Description": "The mod file format has been changed, and mod files created using version 0.2.0.0 will no longer open. You'll need to convert these by navigating to Compatibility > Convert 0.2.0.0 mod file format and select your mod file."
					}
				]
			},
			{
				"VersionNumber": "0.2.0.0",
				"Date": "2019-09-19T00:00:00",
				"Changes": [
					{
						"Description": "Loudness is now exported as a .ini file rather than a .wav file."
					},
					{
						"Description": "Added functionality to export the current loudness values."
					},
					{
						"Description": "Added ability to save and open \"mod\" files (\".audio\" extension for audio mods) which are files containing the asset paths and loudness values. This removes the need to import/export loudness values when closing the application and is way more convenient than having to extract and make huge binary files every time as well. Note that the \"mod\" files only contain local paths, so sharing them will not work."
					},
					{
						"Description": "Fixed not being able to type decimal values in the loudness fields."
					},
					{
						"Description": "Added support to automatically check for new versions of the program."
					},
					{
						"Description": "Added icon."
					},
					{
						"Description": "Added About window and other menu items."
					},
					{
						"Description": "Added logging."
					},
					{
						"Description": "Added description for audio assets (WIP)."
					},
					{
						"Description": "Many GUI and code improvements."
					}
				]
			},
			{
				"VersionNumber": "0.1.0.0",
				"Date": "2019-09-11T00:00:00",
				"Changes": [
					{
						"Description": "Initial release."
					}
				]
			}
		]
	}
]
